pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* GCCTL1 Control Bits */
#define WPIFG                            (0x0010)        /* Write Protection Detection flag */
#define WPIFG_L                          (0x0010)
#define WPIFG_0                          (0x0000)        /* No interrupt pending. */
#define WPIFG_1                          (0x0010)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define WPIFG_1_L                        (0x0010)
#define ACCTEIFG                         (0x0008)        /* Access time error flag */
#define ACCTEIFG_L                       (0x0008)
#define ACCTEIFG_0                       (0x0000)        /* No interrupt pending. */
#define ACCTEIFG_1                       (0x0008)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define ACCTEIFG_1_L                     (0x0008)
#define UBDIFG                           (0x0004)        /* FRAM uncorrectable bit error detection flag */
#define UBDIFG_L                         (0x0004)
#define UBDIFG_0                         (0x0000)        /* No interrupt pending. */
#define UBDIFG_1                         (0x0004)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV when it is the highest pending interrupt. */
#define UBDIFG_1_L                       (0x0004)
#define CBDIFG                           (0x0002)        /* FRAM correctable bit error detection flag */
#define CBDIFG_L                         (0x0002)
#define CBDIFG_0                         (0x0000)        /* No interrupt is pending */
#define CBDIFG_1                         (0x0002)        /* Interrupt pending. Can be cleared by writing '0' or by reading
                                                            SYSSNIV if it is the highest pending interrupt. */
#define CBDIFG_1_L                       (0x0002)


/*****************************************************************************
 HSPLL Registers
*****************************************************************************/

#define __MSP430_HAS_HSPLL__                  /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_HSPLL__ 0x0EE0
#define HSPLL_BASE             __MSP430_BASEADDRESS_HSPLL__

sfr_w(HSPLLIIDX);                             /* Interrupt Index Register */
sfr_b(HSPLLIIDX_L);
sfr_b(HSPLLIIDX_H);
sfr_w(HSPLLMIS);                              /* Masked Interrupt Status Register. */
sfr_b(HSPLLMIS_L);
sfr_b(HSPLLMIS_H);
sfr_w(HSPLLRIS);                              /* Raw Interrupt Status Register */
sfr_b(HSPLLRIS_L);
sfr_b(HSPLLRIS_H);
sfr_w(HSPLLIMSC);                             /* Interrupt Mask Register */
sfr_b(HSPLLIMSC_L);
sfr_b(HSPLLIMSC_H);
sfr_w(HSPLLICR);                              /* Interrupt Flag Clear Register. */
sfr_b(HSPLLICR_L);
sfr_b(HSPLLICR_H);
sfr_w(HSPLLISR);                              /* Interrupt Flag Set Register. */
sfr_b(HSPLLISR_L);
sfr_b(HSPLLISR_H);
sfr_w(HSPLLDESCLO);                           /* HSPLL Descriptor Register L. */
sfr_b(HSPLLDESCLO_L);
sfr_b(HSPLLDESCLO_H);
sfr_w(HSPLLDESCHI);                           /* HSPLL Descriptor Register H. */
sfr_b(HSPLLDESCHI_L);
sfr_b(HSPLLDESCHI_H);
sfr_w(HSPLLCTL);                              /* HSPLL Control Register */
sfr_b(HSPLLCTL_L);
sfr_b(HSPLLCTL_H);
sfr_w(HSPLLUSSXTLCTL);                        /* USSXT Control Register */
sfr_b(HSPLLUSSXTLCTL_L);
sfr_b(HSPLLUSSXTLCTL_H);

/* HSPLL Register Offsets */
#define OFS_HSPLLIIDX                    (0x0000)
#define OFS_HSPLLIIDX_L                  OFS_HSPLLIIDX
#define OFS_HSPLLIIDX_H                  OFS_HSPLLIIDX+1
#define OFS_HSPLLMIS                     (0x0002)
#define OFS_HSPLLMIS_L                   OFS_HSPLLMIS
#define OFS_HSPLLMIS_H                   OFS_HSPLLMIS+1
#define OFS_HSPLLRIS                     (0x0004)
#define OFS_HSPLLRIS_L                   OFS_HSPLLRIS
#define OFS_HSPLLRIS_H                   OFS_HSPLLRIS+1
#define OFS_HSPLLIMSC                    (0x0006)
#define OFS_HSPLLIMSC_L                  OFS_HSPLLIMSC
#define OFS_HSPLLIMSC_H                  OFS_HSPLLIMSC+1
#define OFS_HSPLLICR                     (0x0008)
#define OFS_HSPLLICR_L                   OFS_HSPLLICR
#define OFS_HSPLLICR_H                   OFS_HSPLLICR+1
#define OFS_HSPLLISR                     (0x000A)
#define OFS_HSPLLISR_L                   OFS_HSPLLISR
#define OFS_HSPLLISR_H                   OFS_HSPLLISR+1
#define OFS_HSPLLDESCLO                  (0x000C)
#define OFS_HSPLLDESCLO_L                OFS_HSPLLDESCLO
#define OFS_HSPLLDESCLO_H                OFS_HSPLLDESCLO+1
#define OFS_HSPLLDESCHI                  (0x000E)
#define OFS_HSPLLDESCHI_L                OFS_HSPLLDESCHI
#define OFS_HSPLLDESCHI_H                OFS_HSPLLDESCHI+1
#define OFS_HSPLLCTL                     (0x0010)
#define OFS_HSPLLCTL_L                   OFS_HSPLLCTL
#define OFS_HSPLLCTL_H                   OFS_HSPLLCTL+1
#define OFS_HSPLLUSSXTLCTL               (0x0012)
#define OFS_HSPLLUSSXTLCTL_L             OFS_HSPLLUSSXTLCTL
#define OFS_HSPLLUSSXTLCTL_H             OFS_HSPLLUSSXTLCTL+1

/* HSPLL Control Bits */

/* HSPLLIIDX Control Bits */
#define IIDX                             (0xfffe)        /* HSPLL Interrupt Vector Value */
#define IIDX_L                           (0x00fe)
#define IIDX_H                           (0x00ff)
#define IIDX0                            (0x0002)        /* HSPLL Interrupt Vector Value */
#define IIDX0_L                          (0x0002)
#define IIDX1                            (0x0004)        /* HSPLL Interrupt Vector Value */
#define IIDX1_L                          (0x0004)
#define IIDX2                            (0x0008)        /* HSPLL Interrupt Vector Value */
#define IIDX2_L                          (0x0008)
#define IIDX3                            (0x0010)        /* HSPLL Interrupt Vector Value */
#define IIDX3_L                          (0x0010)
#define IIDX4                            (0x0020)        /* HSPLL Interrupt Vector Value */
#define IIDX4_L                          (0x0020)
#define IIDX5                            (0x0040)        /* HSPLL Interrupt Vector Value */
#define IIDX5_L                          (0x0040)
#define IIDX6                            (0x0080)        /* HSPLL Interrupt Vector Value */
#define IIDX6_L                          (0x0080)
#define IIDX7                            (0x0100)        /* HSPLL Interrupt Vector Value */
#define IIDX7_H                          (0x0001)
#define IIDX8                            (0x0200)        /* HSPLL Interrupt Vector Value */
#define IIDX8_H                          (0x0002)
#define IIDX9                            (0x0400)        /* HSPLL Interrupt Vector Value */
#define IIDX9_H                          (0x0004)
#define IIDX10                           (0x0800)        /* HSPLL Interrupt Vector Value */
#define IIDX10_H                         (0x0008)
#define IIDX11                           (0x1000)        /* HSPLL Interrupt Vector Value */
#define IIDX11_H                         (0x0010)
#define IIDX12                           (0x2000)        /* HSPLL Interrupt Vector Value */
#define IIDX12_H                         (0x0020)
#define IIDX13                           (0x4000)        /* HSPLL Interrupt Vector Value */
#define IIDX13_H                         (0x0040)
#define IIDX14                           (0x8000)        /* HSPLL Interrupt Vector Value */
#define IIDX14_H                         (0x0080)
#define IIDX_0                           (0x0000)        /* No Interrupt pending */
#define IIDX_1                           (0x0002)        /* Interrupt Source: PLLUNLOCK; Interrupt Priority: Highest */
#define IIDX_1_L                         (0x0002)
#define IIDX_2                           (0x0004)        /* Reserved; Interrupt Priority: Lowest */
#define IIDX_2_L                         (0x0004)

/* HSPLLMIS Control Bits */
#define PLLUNLOCK                        (0x0001)        /* HSPLL Unlock Masked Interrupt Status bit */
#define PLLUNLOCK_L                      (0x0001)
#define PLLUNLOCK_0                      (0x0000)        /* No interrupt pending */
#define PLLUNLOCK_1                      (0x0001)        /* Interrupt pending */
#define PLLUNLOCK_1_L                    (0x0001)

/* HSPLLDESCLO Control Bits */
#define MINREV                           (0x000f)        /* Minor Revision */
#define MINREV_L                         (0x000f)
#define MINREV0                          (0x0001)        /* Minor Revision */
#define MINREV0_L                        (0x0001)
#define MINREV1                          (0x0002)        /* Minor Revision */
#define MINREV1_L                        (0x0002)
#define MINREV2                          (0x0004)        /* Minor Revision */
#define MINREV2_L                        (0x0004)
#define MINREV3                          (0x0008)        /* Minor Revision */
#define MINREV3_L                        (0x0008)
#define INSTNUM                          (0x0f00)        /* Instance Number within the device. */
#define INSTNUM_H                        (0x000f)
#define INSTNUM0                         (0x0100)        /* Instance Number within the device. */
#define INSTNUM0_H                       (0x0001)
#define INSTNUM1                         (0x0200)        /* Instance Number within the device. */
#define INSTNUM1_H                       (0x0002)
#define INSTNUM2                         (0x0400)        /* Instance Number within the device. */
#define INSTNUM2_H                       (0x0004)
#define INSTNUM3                         (0x0800)        /* Instance Number within the device. */
#define INSTNUM3_H                       (0x0008)
#define MAJREV                           (0x00f0)        /* Major Revision */
#define MAJREV_L                         (0x00f0)
#define MAJREV0                          (0x0010)        /* Major Revision */
#define MAJREV0_L                        (0x0010)
#define MAJREV1                          (0x0020)        /* Major Revision */
#define MAJREV1_L                        (0x0020)
#define MAJREV2                          (0x0040)        /* Major Revision */
#define MAJREV2_L                        (0x0040)
#define MAJREV3                          (0x0080)        /* Major Revision */
#define MAJREV3_L                        (0x0080)
#define FEATUREVER                       (0xf000)        /* Feature Set for the module */
#define FEATUREVER_H                     (0x00f0)
#define FEATUREVER0                      (0x1000)        /* Feature Set for the module */
#define FEATUREVER0_H                    (0x0010)
#define FEATUREVER1                      (0x2000)        /* Feature Set for the module */
#define FEATUREVER1_H                    (0x0020)
#define FEATUREVER2                      (0x4000)        /* Feature Set for the module */
#define FEATUREVER2_H                    (0x0040)
#define FEATUREVER3                      (0x8000)        /* Feature Set for the module */
#define FEATUREVER3_H                    (0x0080)

/* HSPLLDESCHI Control Bits */
#define MODULEID                         (0xffff)        /* Module Identifier. */
#define MODULEID_L                       (0x00ff)
#define MODULEID_H                       (0x00ff)
#define MODULEID0                        (0x0001)        /* Module Identifier. */
#define MODULEID0_L                      (0x0001)
#define MODULEID1                        (0x0002)        /* Module Identifier. */
#define MODULEID1_L                      (0x0002)
#define MODULEID2                        (0x0004)        /* Module Identifier. */
#define MODULEID2_L                      (0x0004)
#define MODULEID3                        (0x0008)        /* Module Identifier. */
#define MODULEID3_L                      (0x0008)
#define MODULEID4                        (0x0010)        /* Module Identifier. */
#define MODULEID4_L                      (0x0010)
#define MODULEID5                        (0x0020)        /* Module Identifier. */
#define MODULEID5_L                      (0x0020)
#define MODULEID6                        (0x0040)        /* Module Identifier. */
#define MODULEID6_L                      (0x0040)
#define MODULEID7                        (0x0080)        /* Module Identifier. */
#define MODULEID7_L                      (0x0080)
#define MODULEID8                        (0x0100)        /* Module Identifier. */
#define MODULEID8_H                      (0x0001)
#define MODULEID9                        (0x0200)        /* Module Identifier. */
#define MODULEID9_H                      (0x0002)
#define MODULEID10                       (0x0400)        /* Module Identifier. */
#define MODULEID10_H                     (0x0004)
#define MODULEID11                       (0x0800)        /* Module Identifier. */
#define MODULEID11_H                     (0x0008)
#define MODULEID12                       (0x1000)        /* Module Identifier. */
#define MODULEID12_H                     (0x0010)
#define MODULEID13                       (0x2000)        /* Module Identifier. */
#define MODULEID13_H                     (0x0020)
#define MODULEID14                       (0x4000)        /* Module Identifier. */
#define MODULEID14_H                     (0x0040)
#define MODULEID15                       (0x8000)        /* Module Identifier. */
#define MODULEID15_H                     (0x0080)

