pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* MTIFPGCNF Control Bits */
#define PGPW                             (0x5a00)        /* */
#define PGPW_H                           (0x005a)
#define PGPW0                            (0x0100)        /* */
#define PGPW0_H                          (0x0001)
#define PGPW1                            (0x0200)        /* */
#define PGPW1_H                          (0x0002)
#define PGPW2                            (0x0400)        /* */
#define PGPW2_H                          (0x0004)
#define PGPW3                            (0x0800)        /* */
#define PGPW3_H                          (0x0008)
#define PGPW4                            (0x1000)        /* */
#define PGPW4_H                          (0x0010)
#define PGPW5                            (0x2000)        /* */
#define PGPW5_H                          (0x0020)
#define PGPW6                            (0x4000)        /* */
#define PGPW6_H                          (0x0040)
#define PGPW7                            (0x8000)        /* */
#define PGPW7_H                          (0x0080)
#define PGPW_R                           (0x6900)        /* Read value while locked */
#define PGPW_R_H                         (0x0069)
#define PGFS                             (0x0070)        /* */
#define PGFS_L                           (0x0070)
#define PGFS0                            (0x0010)        /* */
#define PGFS0_L                          (0x0010)
#define PGFS1                            (0x0020)        /* */
#define PGFS1_L                          (0x0020)
#define PGFS2                            (0x0040)        /* */
#define PGFS2_L                          (0x0040)
#define PGFS_0                           (0x0000)        /* Pulse grid frequency is set to 8 Hz (nominal) */
#define PGFS_1                           (0x0010)        /* Pulse grid frequency is set to 16 Hz (nominal) */
#define PGFS_1_L                         (0x0010)
#define PGFS_2                           (0x0020)        /* Pulse grid frequency is set to 32 Hz (nominal) */
#define PGFS_2_L                         (0x0020)
#define PGFS_3                           (0x0030)        /* Pulse grid frequency is set to 64 Hz (nominal) */
#define PGFS_3_L                         (0x0030)
#define PGFS_4                           (0x0040)        /* Pulse grid frequency is set to 128 Hz (nominal) */
#define PGFS_4_L                         (0x0040)
#define PGFS_5                           (0x0050)        /* Pulse grid frequency is set to 256 Hz (nominal) */
#define PGFS_5_L                         (0x0050)
#define PGFS_6                           (0x0060)        /* Pulse grid frequency is set to 512 Hz (nominal) */
#define PGFS_6_L                         (0x0060)
#define PGFS_7                           (0x0070)        /* Pulse grid frequency is set to 1024 Hz (nominal) default */
#define PGFS_7_L                         (0x0070)
#define PGCLR                            (0x0004)        /* */
#define PGCLR_L                          (0x0004)
#define PGEN                             (0x0001)        /* */
#define PGEN_L                           (0x0001)

/* MTIFPGKVAL Control Bits */
#define KVAL                             (0x007f)        /* */
#define KVAL_L                           (0x007f)
#define KVAL0                            (0x0001)        /* */
#define KVAL0_L                          (0x0001)
#define KVAL1                            (0x0002)        /* */
#define KVAL1_L                          (0x0002)
#define KVAL2                            (0x0004)        /* */
#define KVAL2_L                          (0x0004)
#define KVAL3                            (0x0008)        /* */
#define KVAL3_L                          (0x0008)
#define KVAL4                            (0x0010)        /* */
#define KVAL4_L                          (0x0010)
#define KVAL5                            (0x0020)        /* */
#define KVAL5_L                          (0x0020)
#define KVAL6                            (0x0040)        /* */
#define KVAL6_L                          (0x0040)

/* MTIFPGCTL Control Bits */
#define PKUR                             (0x0001)        /* */
#define PKUR_L                           (0x0001)
#define PGUR                             (0x0002)        /* */
#define PGUR_L                           (0x0002)

/* MTIFPGSR Control Bits */
#define PKUA                             (0x0001)        /* */
#define PKUA_L                           (0x0001)
#define PGUA                             (0x0002)        /* */
#define PGUA_L                           (0x0002)

/* MTIFPCCNF Control Bits */
#define PCPW                             (0xa500)        /* */
#define PCPW_H                           (0x00a5)
#define PCPW0                            (0x0100)        /* */
#define PCPW0_H                          (0x0001)
#define PCPW1                            (0x0200)        /* */
#define PCPW1_H                          (0x0002)
#define PCPW2                            (0x0400)        /* */
#define PCPW2_H                          (0x0004)
#define PCPW3                            (0x0800)        /* */
#define PCPW3_H                          (0x0008)
#define PCPW4                            (0x1000)        /* */
#define PCPW4_H                          (0x0010)
#define PCPW5                            (0x2000)        /* */
#define PCPW5_H                          (0x0020)
#define PCPW6                            (0x4000)        /* */
#define PCPW6_H                          (0x0040)
#define PCPW7                            (0x8000)        /* */
#define PCPW7_H                          (0x0080)
#define PCPW_R                           (0x9600)        /* Read value while locked */
#define PCPW_R_H                         (0x0096)
#define PCEN                             (0x0001)        /* */
#define PCEN_L                           (0x0001)
#define PCCLR                            (0x0004)        /* */
#define PCCLR_L                          (0x0004)

/* MTIFPCR Control Bits */
#define PCR                              (0xffff)        /* */
#define PCR_L                            (0x00ff)
#define PCR_H                            (0x00ff)
#define PCR0                             (0x0001)        /* */
#define PCR0_L                           (0x0001)
#define PCR1                             (0x0002)        /* */
#define PCR1_L                           (0x0002)
#define PCR2                             (0x0004)        /* */
#define PCR2_L                           (0x0004)
#define PCR3                             (0x0008)        /* */
#define PCR3_L                           (0x0008)
#define PCR4                             (0x0010)        /* */
#define PCR4_L                           (0x0010)
#define PCR5                             (0x0020)        /* */
#define PCR5_L                           (0x0020)
#define PCR6                             (0x0040)        /* */
#define PCR6_L                           (0x0040)
#define PCR7                             (0x0080)        /* */
#define PCR7_L                           (0x0080)
#define PCR8                             (0x0100)        /* */
#define PCR8_H                           (0x0001)
#define PCR9                             (0x0200)        /* */
#define PCR9_H                           (0x0002)
#define PCR10                            (0x0400)        /* */
#define PCR10_H                          (0x0004)
#define PCR11                            (0x0800)        /* */
#define PCR11_H                          (0x0008)
#define PCR12                            (0x1000)        /* */
#define PCR12_H                          (0x0010)
#define PCR13                            (0x2000)        /* */
#define PCR13_H                          (0x0020)
#define PCR14                            (0x4000)        /* */
#define PCR14_H                          (0x0040)
#define PCR15                            (0x8000)        /* */
#define PCR15_H                          (0x0080)

/* MTIFPCCTL Control Bits */
#define PCRR                             (0x0001)        /* */
#define PCRR_L                           (0x0001)

/* MTIFPCSR Control Bits */
#define PCOFL                            (0x0002)        /* */
#define PCOFL_L                          (0x0002)
#define PCRA                             (0x0001)        /* */
#define PCRA_L                           (0x0001)

/* MTIFTPCTL Control Bits */
#define TPPW                             (0xc300)        /* */
#define TPPW_H                           (0x00c3)
#define TPPW0                            (0x0100)        /* */
#define TPPW0_H                          (0x0001)
#define TPPW1                            (0x0200)        /* */
#define TPPW1_H                          (0x0002)
#define TPPW2                            (0x0400)        /* */
#define TPPW2_H                          (0x0004)
#define TPPW3                            (0x0800)        /* */
#define TPPW3_H                          (0x0008)
#define TPPW4                            (0x1000)        /* */
#define TPPW4_H                          (0x0010)
#define TPPW5                            (0x2000)        /* */
#define TPPW5_H                          (0x0020)
#define TPPW6                            (0x4000)        /* */
#define TPPW6_H                          (0x0040)
#define TPPW7                            (0x8000)        /* */
#define TPPW7_H                          (0x0080)
#define TPPW_R                           (0x0f00)        /* Read value while locked */
#define TPPW_R_H                         (0x000f)
#define TPISEL                           (0x0004)        /* */
#define TPISEL_L                         (0x0004)
#define TPISEL_0                         (0x0000)        /* The pulse generator is used as input */
#define TPISEL_1                         (0x0004)        /* The test port input terminal is selected as input */
#define TPISEL_1_L                       (0x0004)
#define TPIE                             (0x0002)        /* */
#define TPIE_L                           (0x0002)
#define TPOE                             (0x0001)        /* */
#define TPOE_L                           (0x0001)
#define ACTIVATE                         (0x0008)        /* */
#define ACTIVATE_L                       (0x0008)
#define ACTIVATE_0                       (0x0000)        /* The test port output is enabled solely by TPOE (enabled if 
                                                            TPOE=1) */
#define ACTIVATE_1                       (0x0008)        /* The testport output requires both TPOE to be high and the MTPE
                                                            pin to be high to be enabled */
#define ACTIVATE_1_L                     (0x0008)


/*****************************************************************************
 PMM Registers
*****************************************************************************/

#define __MSP430_HAS_PMM__                    /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_PMM__ 0x0120
#define PMM_BASE               __MSP430_BASEADDRESS_PMM__

sfr_w(PMMCTL0);                               /* PMM control register 0 */
sfr_b(PMMCTL0_L);
sfr_b(PMMCTL0_H);
sfr_w(PMMIFG);                                /* PMM interrupt flag register */
sfr_b(PMMIFG_L);
sfr_b(PMMIFG_H);
sfr_w(PM5CTL0);                               /* Power mode 5 control register 0 */
sfr_b(PM5CTL0_L);
sfr_b(PM5CTL0_H);

/* PMM Register Offsets */
#define OFS_PMMCTL0                      (0x0000)
#define OFS_PMMCTL0_L                    OFS_PMMCTL0
#define OFS_PMMCTL0_H                    OFS_PMMCTL0+1
#define OFS_PMMIFG                       (0x000A)
#define OFS_PMMIFG_L                     OFS_PMMIFG
#define OFS_PMMIFG_H                     OFS_PMMIFG+1
#define OFS_PM5CTL0                      (0x0010)
#define OFS_PM5CTL0_L                    OFS_PM5CTL0
#define OFS_PM5CTL0_H                    OFS_PM5CTL0+1

