pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* RTCADOWDAY Control Bits */
#define DOW                              (0x0007)        /* Day of week (0 to 6) */
#define DOW_L                            (0x0007)
#define DOW0                             (0x0001)        /* Day of week (0 to 6) */
#define DOW0_L                           (0x0001)
#define DOW1                             (0x0002)        /* Day of week (0 to 6) */
#define DOW1_L                           (0x0002)
#define DOW2                             (0x0004)        /* Day of week (0 to 6) */
#define DOW2_L                           (0x0004)
#define DOWAE                            (0x0080)        /* Alarm enable */
#define DOWAE_L                          (0x0080)
#define DAYAE                            (0x8000)        /* Alarm enable */
#define DAYAE_H                          (0x0080)

/* RTCADOWDAY_BCD Control Bits */
#define DAY_LD                           (0x0f00)        /* Day of month  low digit (0 to 9) */
#define DAY_LD_H                         (0x000f)
#define DAY_LD0                          (0x0100)        /* Day of month  low digit (0 to 9) */
#define DAY_LD0_H                        (0x0001)
#define DAY_LD1                          (0x0200)        /* Day of month  low digit (0 to 9) */
#define DAY_LD1_H                        (0x0002)
#define DAY_LD2                          (0x0400)        /* Day of month  low digit (0 to 9) */
#define DAY_LD2_H                        (0x0004)
#define DAY_LD3                          (0x0800)        /* Day of month  low digit (0 to 9) */
#define DAY_LD3_H                        (0x0008)
#define DAY_HD                           (0x3000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD_H                         (0x0030)
#define DAY_HD0                          (0x1000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD0_H                        (0x0010)
#define DAY_HD1                          (0x2000)        /* Day of month  high digit (0 to 3) */
#define DAY_HD1_H                        (0x0020)


/*****************************************************************************
 SAPH Registers
*****************************************************************************/

#define __MSP430_HAS_SAPH__                   /* Definition to show that module is available */
#define __MSP430_BASEADDRESS_SAPH__ 0x0E00
#define SAPH_BASE              __MSP430_BASEADDRESS_SAPH__

sfr_w(SAPHIIDX);                              /* Interrupt Index */
sfr_b(SAPHIIDX_L);
sfr_b(SAPHIIDX_H);
sfr_w(SAPHMIS);                               /* Masked Interrupt Satus */
sfr_b(SAPHMIS_L);
sfr_b(SAPHMIS_H);
sfr_w(SAPHRIS);                               /* Raw Interrupt Status */
sfr_b(SAPHRIS_L);
sfr_b(SAPHRIS_H);
sfr_w(SAPHIMSC);                              /* Interrupt Mask */
sfr_b(SAPHIMSC_L);
sfr_b(SAPHIMSC_H);
sfr_w(SAPHICR);                               /* Interrupt Clear */
sfr_b(SAPHICR_L);
sfr_b(SAPHICR_H);
sfr_w(SAPHISR);                               /* Interrupt Set */
sfr_b(SAPHISR_L);
sfr_b(SAPHISR_H);
sfr_w(SAPHDESCLO);                            /* Module-Descriptor Low Word */
sfr_b(SAPHDESCLO_L);
sfr_b(SAPHDESCLO_H);
sfr_w(SAPHDESCHI);                            /* Module-Descriptor High Word */
sfr_b(SAPHDESCHI_L);
sfr_b(SAPHDESCHI_H);
sfr_w(SAPHKEY);                               /* Key */
sfr_b(SAPHKEY_L);
sfr_b(SAPHKEY_H);
sfr_w(SAPHOCTL0);                             /* Physical Interface Output Control #0 */
sfr_b(SAPHOCTL0_L);
sfr_b(SAPHOCTL0_H);
sfr_w(SAPHOCTL1);                             /* Physical Interface Output Control #1 */
sfr_b(SAPHOCTL1_L);
sfr_b(SAPHOCTL1_H);
sfr_w(SAPHOSEL);                              /* Physical Interface Output Function Select */
sfr_b(SAPHOSEL_L);
sfr_b(SAPHOSEL_H);
sfr_w(SAPHCH0PUT);                            /* Channel 0 Pull UpTrim Register */
sfr_b(SAPHCH0PUT_L);
sfr_b(SAPHCH0PUT_H);
sfr_w(SAPHCH0PDT);                            /* Channel 0 Pull DownTrim Register */
sfr_b(SAPHCH0PDT_L);
sfr_b(SAPHCH0PDT_H);
sfr_w(SAPHCH0TT);                             /* Channel 0 Termination Trim */
sfr_b(SAPHCH0TT_L);
sfr_b(SAPHCH0TT_H);
sfr_w(SAPHCH1PUT);                            /* Channel 1 Pull UpTrim */
sfr_b(SAPHCH1PUT_L);
sfr_b(SAPHCH1PUT_H);
sfr_w(SAPHCH1PDT);                            /* Channel 1 Pull DownTrim */
sfr_b(SAPHCH1PDT_L);
sfr_b(SAPHCH1PDT_H);
sfr_w(SAPHCH1TT);                             /* Channel 1 Termination Trim */
sfr_b(SAPHCH1TT_L);
sfr_b(SAPHCH1TT_H);
sfr_w(SAPHMCNF);                              /* Mode Configuration Register */
sfr_b(SAPHMCNF_L);
sfr_b(SAPHMCNF_H);
sfr_w(SAPHTACTL);                             /* Trim Access Control */
sfr_b(SAPHTACTL_L);
sfr_b(SAPHTACTL_H);
sfr_w(SAPHICTL0);                             /* Physical Interface Input Control #0 */
sfr_b(SAPHICTL0_L);
sfr_b(SAPHICTL0_H);
sfr_w(SAPHBCTL);                              /* Bias Control */
sfr_b(SAPHBCTL_L);
sfr_b(SAPHBCTL_H);
sfr_w(SAPHPGC);                               /* PPG Count */
sfr_b(SAPHPGC_L);
sfr_b(SAPHPGC_H);
sfr_w(SAPHPGLPER);                            /* Pulse Generator Low Period */
sfr_b(SAPHPGLPER_L);
sfr_b(SAPHPGLPER_H);
sfr_w(SAPHPGHPER);                            /* Pulse Generator High Period */
sfr_b(SAPHPGHPER_L);
sfr_b(SAPHPGHPER_H);
sfr_w(SAPHPGCTL);                             /* PPG Control */
sfr_b(SAPHPGCTL_L);
sfr_b(SAPHPGCTL_H);
sfr_w(SAPHPPGTRIG);                           /* PPG Software Trigger */
sfr_b(SAPHPPGTRIG_L);
sfr_b(SAPHPPGTRIG_H);
sfr_w(SAPHASCTL0);                            /* A-SEQ control register 0 */
sfr_b(SAPHASCTL0_L);
sfr_b(SAPHASCTL0_H);
sfr_w(SAPHASCTL1);                            /* A-SEQ control register 1 */
sfr_b(SAPHASCTL1_L);
sfr_b(SAPHASCTL1_H);
sfr_b(SAPHASQTRIG);                           /* ASQ Software Trigger */

sfr_w(SAPHAPOL);                              /* ASQ ping output polarity */
sfr_b(SAPHAPOL_L);
sfr_b(SAPHAPOL_H);
sfr_w(SAPHAPLEV);                             /* ASQ ping pause level */
sfr_b(SAPHAPLEV_L);
sfr_b(SAPHAPLEV_H);
sfr_w(SAPHAPHIZ);                             /* ASQ ping pause impedance */
sfr_b(SAPHAPHIZ_L);
sfr_b(SAPHAPHIZ_H);
sfr_w(SAPHATM_A);                             /* A-SEQ start to 1st ping */
sfr_b(SAPHATM_A_L);
sfr_b(SAPHATM_A_H);
sfr_w(SAPHATM_B);                             /* ASQ start to ADC arm */
sfr_b(SAPHATM_B_L);
sfr_b(SAPHATM_B_H);
sfr_w(SAPHATM_C);                             /* Count for the TIMEMARK C Event */
sfr_b(SAPHATM_C_L);
sfr_b(SAPHATM_C_H);
sfr_w(SAPHATM_D);                             /* ASQ start to ADC trig */
sfr_b(SAPHATM_D_L);
sfr_b(SAPHATM_D_H);
sfr_w(SAPHATM_E);                             /* ASQ start to restart */
sfr_b(SAPHATM_E_L);
sfr_b(SAPHATM_E_H);
sfr_w(SAPHATM_F);                             /* ASQ start to timeout */
sfr_b(SAPHATM_F_L);
sfr_b(SAPHATM_F_H);
sfr_w(SAPHTBCTL);                             /* Time Base Control */
sfr_b(SAPHTBCTL_L);
sfr_b(SAPHTBCTL_H);
sfr_w(SAPHATIMLO);                            /* Acquisition Timer Low Part */
sfr_b(SAPHATIMLO_L);
sfr_b(SAPHATIMLO_H);
sfr_w(SAPHATIMHI);                            /* Acquisition Timer High Part */
sfr_b(SAPHATIMHI_L);
sfr_b(SAPHATIMHI_H);

/* SAPH Register Offsets */
#define OFS_SAPHIIDX                     (0x0000)
#define OFS_SAPHIIDX_L                   OFS_SAPHIIDX
#define OFS_SAPHIIDX_H                   OFS_SAPHIIDX+1
#define OFS_SAPHMIS                      (0x0002)
#define OFS_SAPHMIS_L                    OFS_SAPHMIS
#define OFS_SAPHMIS_H                    OFS_SAPHMIS+1
#define OFS_SAPHRIS                      (0x0004)
#define OFS_SAPHRIS_L                    OFS_SAPHRIS
#define OFS_SAPHRIS_H                    OFS_SAPHRIS+1
#define OFS_SAPHIMSC                     (0x0006)
#define OFS_SAPHIMSC_L                   OFS_SAPHIMSC
#define OFS_SAPHIMSC_H                   OFS_SAPHIMSC+1
#define OFS_SAPHICR                      (0x0008)
#define OFS_SAPHICR_L                    OFS_SAPHICR
#define OFS_SAPHICR_H                    OFS_SAPHICR+1
#define OFS_SAPHISR                      (0x000A)
#define OFS_SAPHISR_L                    OFS_SAPHISR
#define OFS_SAPHISR_H                    OFS_SAPHISR+1
#define OFS_SAPHDESCLO                   (0x000C)
#define OFS_SAPHDESCLO_L                 OFS_SAPHDESCLO
#define OFS_SAPHDESCLO_H                 OFS_SAPHDESCLO+1
#define OFS_SAPHDESCHI                   (0x000E)
#define OFS_SAPHDESCHI_L                 OFS_SAPHDESCHI
#define OFS_SAPHDESCHI_H                 OFS_SAPHDESCHI+1
#define OFS_SAPHKEY                      (0x0010)
#define OFS_SAPHKEY_L                    OFS_SAPHKEY
#define OFS_SAPHKEY_H                    OFS_SAPHKEY+1
#define OFS_SAPHOCTL0                    (0x0012)
#define OFS_SAPHOCTL0_L                  OFS_SAPHOCTL0
#define OFS_SAPHOCTL0_H                  OFS_SAPHOCTL0+1
#define OFS_SAPHOCTL1                    (0x0014)
#define OFS_SAPHOCTL1_L                  OFS_SAPHOCTL1
#define OFS_SAPHOCTL1_H                  OFS_SAPHOCTL1+1
#define OFS_SAPHOSEL                     (0x0016)
#define OFS_SAPHOSEL_L                   OFS_SAPHOSEL
#define OFS_SAPHOSEL_H                   OFS_SAPHOSEL+1
#define OFS_SAPHCH0PUT                   (0x0020)
#define OFS_SAPHCH0PUT_L                 OFS_SAPHCH0PUT
#define OFS_SAPHCH0PUT_H                 OFS_SAPHCH0PUT+1
#define OFS_SAPHCH0PDT                   (0x0022)
#define OFS_SAPHCH0PDT_L                 OFS_SAPHCH0PDT
#define OFS_SAPHCH0PDT_H                 OFS_SAPHCH0PDT+1
#define OFS_SAPHCH0TT                    (0x0024)
#define OFS_SAPHCH0TT_L                  OFS_SAPHCH0TT
#define OFS_SAPHCH0TT_H                  OFS_SAPHCH0TT+1
#define OFS_SAPHCH1PUT                   (0x0026)
#define OFS_SAPHCH1PUT_L                 OFS_SAPHCH1PUT
#define OFS_SAPHCH1PUT_H                 OFS_SAPHCH1PUT+1
#define OFS_SAPHCH1PDT                   (0x0028)
#define OFS_SAPHCH1PDT_L                 OFS_SAPHCH1PDT
#define OFS_SAPHCH1PDT_H                 OFS_SAPHCH1PDT+1
#define OFS_SAPHCH1TT                    (0x002A)
#define OFS_SAPHCH1TT_L                  OFS_SAPHCH1TT
#define OFS_SAPHCH1TT_H                  OFS_SAPHCH1TT+1
#define OFS_SAPHMCNF                     (0x002C)
#define OFS_SAPHMCNF_L                   OFS_SAPHMCNF
#define OFS_SAPHMCNF_H                   OFS_SAPHMCNF+1
#define OFS_SAPHTACTL                    (0x002E)
#define OFS_SAPHTACTL_L                  OFS_SAPHTACTL
#define OFS_SAPHTACTL_H                  OFS_SAPHTACTL+1
#define OFS_SAPHICTL0                    (0x0030)
#define OFS_SAPHICTL0_L                  OFS_SAPHICTL0
#define OFS_SAPHICTL0_H                  OFS_SAPHICTL0+1
#define OFS_SAPHBCTL                     (0x0034)
#define OFS_SAPHBCTL_L                   OFS_SAPHBCTL
#define OFS_SAPHBCTL_H                   OFS_SAPHBCTL+1
#define OFS_SAPHPGC                      (0x0040)
#define OFS_SAPHPGC_L                    OFS_SAPHPGC
#define OFS_SAPHPGC_H                    OFS_SAPHPGC+1
#define OFS_SAPHPGLPER                   (0x0042)
#define OFS_SAPHPGLPER_L                 OFS_SAPHPGLPER
#define OFS_SAPHPGLPER_H                 OFS_SAPHPGLPER+1
#define OFS_SAPHPGHPER                   (0x0044)
#define OFS_SAPHPGHPER_L                 OFS_SAPHPGHPER
#define OFS_SAPHPGHPER_H                 OFS_SAPHPGHPER+1
#define OFS_SAPHPGCTL                    (0x0046)
#define OFS_SAPHPGCTL_L                  OFS_SAPHPGCTL
#define OFS_SAPHPGCTL_H                  OFS_SAPHPGCTL+1
#define OFS_SAPHPPGTRIG                  (0x0048)
#define OFS_SAPHPPGTRIG_L                OFS_SAPHPPGTRIG
#define OFS_SAPHPPGTRIG_H                OFS_SAPHPPGTRIG+1
#define OFS_SAPHASCTL0                   (0x0060)
#define OFS_SAPHASCTL0_L                 OFS_SAPHASCTL0
#define OFS_SAPHASCTL0_H                 OFS_SAPHASCTL0+1
#define OFS_SAPHASCTL1                   (0x0062)
#define OFS_SAPHASCTL1_L                 OFS_SAPHASCTL1
#define OFS_SAPHASCTL1_H                 OFS_SAPHASCTL1+1
#define OFS_SAPHASQTRIG                  (0x0064)
#define OFS_SAPHAPOL                     (0x0066)
#define OFS_SAPHAPOL_L                   OFS_SAPHAPOL
#define OFS_SAPHAPOL_H                   OFS_SAPHAPOL+1
#define OFS_SAPHAPLEV                    (0x0068)
#define OFS_SAPHAPLEV_L                  OFS_SAPHAPLEV
#define OFS_SAPHAPLEV_H                  OFS_SAPHAPLEV+1
#define OFS_SAPHAPHIZ                    (0x006A)
#define OFS_SAPHAPHIZ_L                  OFS_SAPHAPHIZ
#define OFS_SAPHAPHIZ_H                  OFS_SAPHAPHIZ+1
#define OFS_SAPHATM_A                    (0x006E)
#define OFS_SAPHATM_A_L                  OFS_SAPHATM_A
#define OFS_SAPHATM_A_H                  OFS_SAPHATM_A+1
#define OFS_SAPHATM_B                    (0x0070)
#define OFS_SAPHATM_B_L                  OFS_SAPHATM_B
#define OFS_SAPHATM_B_H                  OFS_SAPHATM_B+1
#define OFS_SAPHATM_C                    (0x0072)
#define OFS_SAPHATM_C_L                  OFS_SAPHATM_C
#define OFS_SAPHATM_C_H                  OFS_SAPHATM_C+1
#define OFS_SAPHATM_D                    (0x0074)
#define OFS_SAPHATM_D_L                  OFS_SAPHATM_D
#define OFS_SAPHATM_D_H                  OFS_SAPHATM_D+1
#define OFS_SAPHATM_E                    (0x0076)
#define OFS_SAPHATM_E_L                  OFS_SAPHATM_E
#define OFS_SAPHATM_E_H                  OFS_SAPHATM_E+1
#define OFS_SAPHATM_F                    (0x0078)
#define OFS_SAPHATM_F_L                  OFS_SAPHATM_F
#define OFS_SAPHATM_F_H                  OFS_SAPHATM_F+1
#define OFS_SAPHTBCTL                    (0x007A)
#define OFS_SAPHTBCTL_L                  OFS_SAPHTBCTL
#define OFS_SAPHTBCTL_H                  OFS_SAPHTBCTL+1
#define OFS_SAPHATIMLO                   (0x007C)
#define OFS_SAPHATIMLO_L                 OFS_SAPHATIMLO
#define OFS_SAPHATIMLO_H                 OFS_SAPHATIMLO+1
#define OFS_SAPHATIMHI                   (0x007E)
#define OFS_SAPHATIMHI_L                 OFS_SAPHATIMHI
#define OFS_SAPHATIMHI_H                 OFS_SAPHATIMHI+1

