pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* SAPH Control Bits */

/* SAPHIIDX Control Bits */
#define IIDX_3                           (0x0006)        /* The interrupt occurs when ASQ completes all of the 
                                                            measurements programmed in ASCTL0.PNGCNT. For example, when 
                                                            ASCTL0.PNGCNT = 3, total four measurements are performed. The 
                                                            interrupt indicates that all of the four measurements have 
                                                            been completed.  Note: After the ASQ is triggered, if the 
                                                            current measurement is interrupted by entering debug halt mode
                                                            (UUPS.RIS.STPBYDB = 1), the SEQDN interrupt is also reported. */
#define IIDX_3_L                         (0x0006)
#define IIDX_4                           (0x0008)        /* The interrupt occurs when the PPG completes pulse generation. */
#define IIDX_4_L                         (0x0008)
#define IIDX__NONE                       (0x0000)        /* no interrupts pending */
#define IIDX__DATAERR                    (0x0002)        /* This interrupt indicates that either WINHI interrupt or WINLO 
                                                            interrupt has occurred in SDHS. */
#define IIDX__DATAERR_L                  (0x0002)
#define IIDX__TMFTO                      (0x0004)        /* This interrupt is valid when ASQ is activcve (auto mode). The 
                                                            interrupt indicates that the time counter in ASQ has reached 
                                                            to TIMEMARK_F (timeout). */
#define IIDX__TMFTO_L                    (0x0004)
#define IIDX__SEQDN                      (0x0006)        /* The interrupt occurs when ASQ completes all of the 
                                                            measurements programmed in ASCTL0.PNGCNT. For example, when 
                                                            ASCTL0.PNGCNT = 3, total four measurements are performed. The 
                                                            interrupt indicates that all of the four measurements have 
                                                            been completed.  Note: After the ASQ is triggered, if the 
                                                            current measurement is interrupted by entering debug halt mode
                                                            (UUPS.RIS.STPBYDB = 1), the SEQDN interrupt is also reported. */
#define IIDX__SEQDN_L                    (0x0006)
#define IIDX__PNGDN                      (0x0008)        /* The interrupt occurs when the PPG completes pulse generation. */
#define IIDX__PNGDN_L                    (0x0008)

/* SAPHMIS Control Bits */
#define DATAERR                          (0x0001)        /* */
#define DATAERR_L                        (0x0001)
#define TMFTO                            (0x0002)        /* */
#define TMFTO_L                          (0x0002)
#define SEQDN                            (0x0004)        /* */
#define SEQDN_L                          (0x0004)
#define PNGDN                            (0x0008)        /* */
#define PNGDN_L                          (0x0008)

/* SAPHKEY Control Bits */
#define KEY                              (0x454b)        /* KEYID Key and ID */
#define KEY_L                            (0x004b)
#define KEY_H                            (0x0045)
#define KEY0                             (0x0001)        /* KEYID Key and ID */
#define KEY0_L                           (0x0001)
#define KEY1                             (0x0002)        /* KEYID Key and ID */
#define KEY1_L                           (0x0002)
#define KEY2                             (0x0004)        /* KEYID Key and ID */
#define KEY2_L                           (0x0004)
#define KEY3                             (0x0008)        /* KEYID Key and ID */
#define KEY3_L                           (0x0008)
#define KEY4                             (0x0010)        /* KEYID Key and ID */
#define KEY4_L                           (0x0010)
#define KEY5                             (0x0020)        /* KEYID Key and ID */
#define KEY5_L                           (0x0020)
#define KEY6                             (0x0040)        /* KEYID Key and ID */
#define KEY6_L                           (0x0040)
#define KEY7                             (0x0080)        /* KEYID Key and ID */
#define KEY7_L                           (0x0080)
#define KEY8                             (0x0100)        /* KEYID Key and ID */
#define KEY8_H                           (0x0001)
#define KEY9                             (0x0200)        /* KEYID Key and ID */
#define KEY9_H                           (0x0002)
#define KEY10                            (0x0400)        /* KEYID Key and ID */
#define KEY10_H                          (0x0004)
#define KEY11                            (0x0800)        /* KEYID Key and ID */
#define KEY11_H                          (0x0008)
#define KEY12                            (0x1000)        /* KEYID Key and ID */
#define KEY12_H                          (0x0010)
#define KEY13                            (0x2000)        /* KEYID Key and ID */
#define KEY13_H                          (0x0020)
#define KEY14                            (0x4000)        /* KEYID Key and ID */
#define KEY14_H                          (0x0040)
#define KEY15                            (0x8000)        /* KEYID Key and ID */
#define KEY15_H                          (0x0080)

/* SAPHOCTL0 Control Bits */
#define CH0OE                            (0x0001)        /* */
#define CH0OE_L                          (0x0001)
#define CH0OE_0                          (0x0000)        /* Ch0 Output is HiZ */
#define CH0OE_1                          (0x0001)        /* CH0 Output is driving */
#define CH0OE_1_L                        (0x0001)
#define CH1OE                            (0x0002)        /* */
#define CH1OE_L                          (0x0002)
#define CH1OE_0                          (0x0000)        /* Ch1 Output is HiZ */
#define CH1OE_1                          (0x0002)        /* CH1 Output is driving */
#define CH1OE_1_L                        (0x0002)
#define CH0OUT                           (0x0100)        /* */
#define CH0OUT_H                         (0x0001)
#define CH0OUT_0                         (0x0000)        /* Ch0 is set to low signal */
#define CH0OUT_1                         (0x0100)        /* Ch0 is set to high signal */
#define CH0OUT_1_H                       (0x0001)
#define CH1OUT                           (0x0200)        /* */
#define CH1OUT_H                         (0x0002)
#define CH1OUT_0                         (0x0000)        /* Ch1 is set to low signal */
#define CH1OUT_1                         (0x0200)        /* Ch1 is set to high signal */
#define CH1OUT_1_H                       (0x0002)

/* SAPHOCTL1 Control Bits */
#define CH0TERM                          (0x0001)        /* */
#define CH0TERM_L                        (0x0001)
#define CH0TERM_0                        (0x0000)        /* CH0 Output is defined by CH0OUT and CH0OE */
#define CH0TERM_1                        (0x0001)        /* CH0 Output is set low with termination strength */
#define CH0TERM_1_L                      (0x0001)
#define CH1TERM                          (0x0002)        /* */
#define CH1TERM_L                        (0x0002)
#define CH1TERM_0                        (0x0000)        /* CH1 Output is defined by CH1OUT and CH1OE */
#define CH1TERM_1                        (0x0002)        /* CH1 Output is set low with termination strength */
#define CH1TERM_1_L                      (0x0002)
#define CH0FP                            (0x0100)        /* */
#define CH0FP_H                          (0x0001)
#define CH0FP_0                          (0x0000)        /* Ch0 Output is set to normal strength */
#define CH0FP_1                          (0x0100)        /* Ch0 Output is set to maximum strength */
#define CH0FP_1_H                        (0x0001)
#define CH1FP                            (0x0200)        /* */
#define CH1FP_H                          (0x0002)
#define CH1FP_0                          (0x0000)        /* Ch1 Output is set to normal strength */
#define CH1FP_1                          (0x0200)        /* Ch1 Output is set to maximum strength */
#define CH1FP_1_H                        (0x0002)

