pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* SAPHOSEL Control Bits */
#define PCH0SEL                          (0x0003)        /* */
#define PCH0SEL_L                        (0x0003)
#define PCH0SEL0                         (0x0001)        /* */
#define PCH0SEL0_L                       (0x0001)
#define PCH0SEL1                         (0x0002)        /* */
#define PCH0SEL1_L                       (0x0002)
#define PCH0SEL_0                        (0x0000)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL_1                        (0x0001)        /* CH0_OUT is driven by the PPG. */
#define PCH0SEL_1_L                      (0x0001)
#define PCH0SEL_2                        (0x0002)        /* CH0_OUT is driven by the PPG as differential output along with
                                                            CH1_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity) */
#define PCH0SEL_2_L                      (0x0002)
#define PCH0SEL_3                        (0x0003)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL_3_L                      (0x0003)
#define PCH0SEL__GPIO                    (0x0000)        /* CH0_OUT is used as a GPO pin. It is controlled by OCTL0.CH0OUT
                                                            and OCTL0.CH0OE. */
#define PCH0SEL__PPGSE                   (0x0001)        /* CH0_OUT is driven by the PPG. */
#define PCH0SEL__PPGSE_L                 (0x0001)
#define PCH1SEL                          (0x000c)        /* */
#define PCH1SEL_L                        (0x000c)
#define PCH1SEL0                         (0x0004)        /* */
#define PCH1SEL0_L                       (0x0004)
#define PCH1SEL1                         (0x0008)        /* */
#define PCH1SEL1_L                       (0x0008)
#define PCH1SEL_0                        (0x0000)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL_1                        (0x0004)        /* CH1_OUT is driven by the PPG. */
#define PCH1SEL_1_L                      (0x0004)
#define PCH1SEL_2                        (0x0008)        /* CH1_OUT is driven by the PPG as differential output along with
                                                            CH0_OUT. (CH0_OUT and CH1_OUT are alwasy opposite polarity) */
#define PCH1SEL_2_L                      (0x0008)
#define PCH1SEL_3                        (0x000c)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL_3_L                      (0x000c)
#define PCH1SEL__GPIO                    (0x0000)        /* CH1_OUT is used as a GPO pin. It is controlled by OCTL0.CH1OUT
                                                            and OCTL0.CH1OE. */
#define PCH1SEL__PPGSE                   (0x0004)        /* CH1_OUT is driven by the PPG. */
#define PCH1SEL__PPGSE_L                 (0x0004)

/* SAPHCH0PUT Control Bits */
#define CH0PUT                           (0x000f)        /* */
#define CH0PUT_L                         (0x000f)
#define CH0PUT0                          (0x0001)        /* */
#define CH0PUT0_L                        (0x0001)
#define CH0PUT1                          (0x0002)        /* */
#define CH0PUT1_L                        (0x0002)
#define CH0PUT2                          (0x0004)        /* */
#define CH0PUT2_L                        (0x0004)
#define CH0PUT3                          (0x0008)        /* */
#define CH0PUT3_L                        (0x0008)

/* SAPHCH0PDT Control Bits */
#define CH0PDT                           (0x000f)        /* */
#define CH0PDT_L                         (0x000f)
#define CH0PDT0                          (0x0001)        /* */
#define CH0PDT0_L                        (0x0001)
#define CH0PDT1                          (0x0002)        /* */
#define CH0PDT1_L                        (0x0002)
#define CH0PDT2                          (0x0004)        /* */
#define CH0PDT2_L                        (0x0004)
#define CH0PDT3                          (0x0008)        /* */
#define CH0PDT3_L                        (0x0008)

/* SAPHCH0TT Control Bits */
#define CH0TT                            (0x000f)        /* */
#define CH0TT_L                          (0x000f)
#define CH0TT0                           (0x0001)        /* */
#define CH0TT0_L                         (0x0001)
#define CH0TT1                           (0x0002)        /* */
#define CH0TT1_L                         (0x0002)
#define CH0TT2                           (0x0004)        /* */
#define CH0TT2_L                         (0x0004)
#define CH0TT3                           (0x0008)        /* */
#define CH0TT3_L                         (0x0008)

/* SAPHCH1PUT Control Bits */
#define CH1PUT                           (0x000f)        /* */
#define CH1PUT_L                         (0x000f)
#define CH1PUT0                          (0x0001)        /* */
#define CH1PUT0_L                        (0x0001)
#define CH1PUT1                          (0x0002)        /* */
#define CH1PUT1_L                        (0x0002)
#define CH1PUT2                          (0x0004)        /* */
#define CH1PUT2_L                        (0x0004)
#define CH1PUT3                          (0x0008)        /* */
#define CH1PUT3_L                        (0x0008)

/* SAPHCH1PDT Control Bits */
#define CH1PDT                           (0x000f)        /* */
#define CH1PDT_L                         (0x000f)
#define CH1PDT0                          (0x0001)        /* */
#define CH1PDT0_L                        (0x0001)
#define CH1PDT1                          (0x0002)        /* */
#define CH1PDT1_L                        (0x0002)
#define CH1PDT2                          (0x0004)        /* */
#define CH1PDT2_L                        (0x0004)
#define CH1PDT3                          (0x0008)        /* */
#define CH1PDT3_L                        (0x0008)

