pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr6045.h
/* SAPHASCTL0 Control Bits */
#define PNGCNT                           (0x0003)        /* */
#define PNGCNT_L                         (0x0003)
#define PNGCNT0                          (0x0001)        /* */
#define PNGCNT0_L                        (0x0001)
#define PNGCNT1                          (0x0002)        /* */
#define PNGCNT1_L                        (0x0002)
#define ASQCHSEL                         (0x0010)        /* */
#define ASQCHSEL_L                       (0x0010)
#define ASQCHSEL_0                       (0x0000)        /* CH0 is selected to start with.  If ASCTL0.PNGCNT = 3 and 
                                                            ASCTL1.CHTOG =1, then the channel selection would be CH0 -> 
                                                            CH1 -> CH0 -> CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =0, 
                                                            then the channel selection would be CH0 -> CH0 -> CH0 -> CH0. */
#define ASQCHSEL_1                       (0x0010)        /* CH1 is selected to start with.  If ASCTL0.PNGCNT = 3 and 
                                                            ASCTL1.CHTOG =0, then the channel selection would be CH1 -> 
                                                            CH1 -> CH1 -> CH1. If ASCTL0.PNGCNT = 3 and ASCTL1.CHTOG =1, 
                                                            then the channel selection would be CH1 -> CH0 -> CH1 -> CH0. */
#define ASQCHSEL_1_L                     (0x0010)
#define ASQSTOP                          (0x0080)        /* */
#define ASQSTOP_L                        (0x0080)
#define ASQTEN                           (0x0200)        /* */
#define ASQTEN_H                         (0x0002)
#define ASQEN_0                          (0x0000)        /* ASQ trigger is disabled. */
#define ASQEN_1                          (0x0200)        /* ASQ trigger is enabled. */
#define ASQEN_1_H                        (0x0002)
#define TRIGSEL                          (0x0c00)        /* */
#define TRIGSEL_H                        (0x000c)
#define TRIGSEL0                         (0x0400)        /* */
#define TRIGSEL0_H                       (0x0004)
#define TRIGSEL1                         (0x0800)        /* */
#define TRIGSEL1_H                       (0x0008)
#define TRIGSEL_0                        (0x0000)        /* Writing '1' to ASQTRIG.ASQTRIG */
#define TRIGSEL_1                        (0x0400)        /* The PSQ is selected to start the ASQ. */
#define TRIGSEL_1_H                      (0x0004)
#define TRIGSEL_2                        (0x0800)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL_2_H                      (0x0008)
#define TRIGSEL_3                        (0x0c00)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL_3_H                      (0x000c)
#define TRIGSEL__SWTRIG                  (0x0000)        /* Writing '1' to ASQTRIG.ASQTRIG */
#define TRIGSEL__PSQ                     (0x0400)        /* The PSQ is selected to start the ASQ. */
#define TRIGSEL__PSQ_H                   (0x0004)
#define TRIGSEL__TIMER                   (0x0800)        /* Ext. Signal (See device specific datasheet) */
#define TRIGSEL__TIMER_H                 (0x0008)
#define ERABRT                           (0x2000)        /* */
#define ERABRT_H                         (0x0020)
#define ERABRT_0                         (0x0000)        /* Continue the measurements until completion regardless of the 
                                                            DATAERR interrupt. */
#define ERABRT_1                         (0x2000)        /* Stop the ASQ upon the DATAERR interrupt. */
#define ERABRT_1_H                       (0x0020)

/* SAPHASCTL1 Control Bits */
#define CHTOG                            (0x0001)        /* */
#define CHTOG_L                          (0x0001)
#define CHTOG_0                          (0x0000)        /* Channel toggle is disabled. */
#define CHTOG_1                          (0x0001)        /* Channel toggle is enabled at each PNGDN interrupt. */
#define CHTOG_1_L                        (0x0001)
#define CHACT                            (0x0010)        /* */
#define CHACT_L                          (0x0010)
#define EARLYRB                          (0x0080)        /* */
#define EARLYRB_L                        (0x0080)
#define EARLYRB_0                        (0x0000)        /* Rx bias is applied to the Rx channel by the TIMEMARK C */
#define EARLYRB_1                        (0x0080)        /* Rx bias is applied to the Rx channel by the TIMEMARK A */
#define EARLYRB_1_L                      (0x0080)
#define ESOFF                            (0x0100)        /* */
#define ESOFF_H                          (0x0001)
#define ESOFF_0                          (0x0000)        /* OFF request is disabled. The ASQ does not send a request about
                                                            USS power mode to the PSQ. */
#define ESOFF_1                          (0x0100)        /* OFF request is generated after sequence */
#define ESOFF_1_H                        (0x0001)
#define STDBY                            (0x0400)        /* */
#define STDBY_H                          (0x0004)
#define STDBY_0                          (0x0000)        /* The ASQ sends a power down request to the PSQ (Power 
                                                            Sequencer) when the OFF request is received. */
#define STDBY_1                          (0x0400)        /* The ASQ sends a standby request to the PSQ (Power Sequencer) 
                                                            when the OFF request is received. */
#define STDBY_1_H                        (0x0004)
#define STDBY__PWROFF                    (0x0000)        /* The ASQ sends a power down request to the PSQ (Power 
                                                            Sequencer) when the OFF request is received. */
#define STDBY__STDBY                     (0x0400)        /* The ASQ sends a standby request to the PSQ (Power Sequencer) 
                                                            when the OFF request is received. */
#define STDBY__STDBY_H                   (0x0004)
#define CHOWN                            (0x0800)        /* */
#define CHOWN_H                          (0x0008)
#define CHOWN_0                          (0x0000)        /* Tx channel and Rx channel are not the same (This is the 
                                                            typical configuration). */
#define CHOWN_1                          (0x0800)        /* Tx channel and Rx channel are identical. */
#define CHOWN_1_H                        (0x0008)

